
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>添加事件 · Construct3中文翻译文档</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="xu_yanfeng">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-title/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="logic.html" />
    
    
    <link rel="prev" href="behaviors.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    新手指南
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="beginner-guide.html">
            
                <a href="beginner-guide.html">
            
                    
                    初学者教程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="object.html">
            
                <a href="object.html">
            
                    
                    添加对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="behaviors.html">
            
                <a href="behaviors.html">
            
                    
                    添加行为
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="event.html">
            
                <a href="event.html">
            
                    
                    添加事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="logic.html">
            
                <a href="logic.html">
            
                    
                    添加游戏逻辑
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    使用变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="keeping-score.html">
            
                <a href="keeping-score.html">
            
                    
                    记录分数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="display-score.html">
            
                <a href="display-score.html">
            
                    
                    显示分数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="finish.html">
            
                <a href="finish.html">
            
                    
                    完成
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    官方完整手册
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../document/Home.html">
            
                <a href="../document/Home.html">
            
                    
                    主页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../document/behaviors-reference.html">
            
                <a href="../document/behaviors-reference.html">
            
                    
                    行为参考
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../document/plugin.html">
            
                <a href="../document/plugin.html">
            
                    
                    插件
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >添加事件</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E8B;&#x4EF6;">&#x4E8B;&#x4EF6;</h1>
<p>&#x9996;&#x5148;&#x70B9;&#x51FB;&#x9876;&#x90E8;&#x7684;<code>Event Sheet 1</code>&#x9009;&#x9879;&#x5361;&#x5207;&#x6362;&#x5230;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x9884;&#x89C8;&#xFF0C;&#x8FD9;&#x91CC;&#x5C55;&#x793A;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6E38;&#x620F;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x3002;</p>
<p>&#x4E8B;&#x4EF6;&#x5217;&#x8868;&#x91CC;&#x9762;&#x8FD8;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#xFF0C;&#x672C;&#x6559;&#x7A0B;&#x4E2D;&#x6682;&#x65F6;&#x6211;&#x4EEC;&#x5148;&#x4E0D;&#x4E8B;&#x4EF6;&#x5D4C;&#x5957;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><img src="evnet/08ec7be6.png" alt=""></p>
<h1 id="&#x5173;&#x4E8E;&#x4E8B;&#x4EF6;&#x7684;&#x8BF4;&#x660E;">&#x5173;&#x4E8E;&#x4E8B;&#x4EF6;&#x7684;&#x8BF4;&#x660E;</h1>
<p>&#x5F53;&#x4F60;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x65F6;&#xFF0C;Construct&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x63D0;&#x793A;
<img src="evnet/394c927d.png" alt="">
&#x5927;&#x6982;&#x610F;&#x601D;&#x662F;&#x8BF4;&#xFF0C;&#x6E38;&#x620F;&#x7684;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x4F1A;&#x8FD0;&#x884C;&#x4E00;&#x904D;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x91CC;&#x9762;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#x3002;
Construct&#x4F1A;&#x5C3D;&#x91CF;&#x6700;&#x5E73;&#x6ED1;&#x7684;&#x5237;&#x65B0;&#x6E38;&#x620F;&#xFF0C;&#x901A;&#x5E38;&#x6E38;&#x620F;&#x6BCF;&#x79D2;&#x5237;&#x65B0;60&#x5E27;&#xFF0C;&#x5373;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x6BCF;&#x79D2;&#x8FD0;&#x884C;60&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x5237;&#x65B0;&#x90FD;&#x4F1A;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x6E38;&#x620F;&#x3002;</p>
<p>&#x4E8B;&#x4EF6;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x662F;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#xFF0C;&#x56E0;&#x6B64;&#x9876;&#x90E8;&#x7684;&#x4E8B;&#x4EF6;&#x662F;&#x6700;&#x5148;&#x8FD0;&#x884C;&#x7684;&#x3002;</p>
<h1 id="&#x6761;&#x4EF6;conditions&#xFF0C;&#x52A8;&#x4F5C;actions&#xFF0C;&#x5B50;&#x4E8B;&#x4EF6;sub-events">&#x6761;&#x4EF6;(conditions)&#xFF0C;&#x52A8;&#x4F5C;(actions)&#xFF0C;&#x5B50;&#x4E8B;&#x4EF6;(sub-events)</h1>
<p>&#x4E8B;&#x4EF6;&#x7531;&#x6761;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x5F53;&#x6761;&#x4EF6;&#x6EE1;&#x8DB3;&#x65F6;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x6761;&#x4EF6;&#x662F;<code>&#x662F;&#x5426;&#x6309;&#x4E0B;&#x4E86;&#x7A7A;&#x683C;&#x952E;&#xFF1F;</code>&#xFF0C;&#x5F53;&#x6309;&#x4E0B;&#x7A7A;&#x683C;&#x952E;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5BF9;&#x5E94;&#x7684;&#x6240;&#x6709;&#x52A8;&#x4F5C;(actions)&#x3002;</p>
<p>&#x5728;&#x6240;&#x6709;&#x7684;&#x52A8;&#x4F5C;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x7D27;&#x63A5;&#x7740;&#x5B50;&#x4E8B;&#x4EF6;(sub-events)&#x5C31;&#x4F1A;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B50;&#x4E8B;&#x4EF6;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x6761;&#x4EF6;&#x3001;&#x52A8;&#x4F5C;&#xFF0C;&#x5B50;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x4E8B;&#x4EF6;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x6E38;&#x620F;&#x903B;&#x8F91;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x591A;&#x6837;&#x3001;&#x590D;&#x6742;&#x3002;</p>
<p>&#x672C;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x5148;&#x4E0D;&#x4F7F;&#x7528;&#x5B50;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x8FD0;&#x884C;&#x6D41;&#x7A0B;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;
<img src="evnet/43645fff.png" alt=""></p>
<p>&#x56FE;&#x793A;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x6982;&#x62EC;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x8BA4;&#x4E3A;&#x6D41;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5F53;&#x7136;Construct&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x8BB8;&#x591A;&#x4E8B;&#x4EF6;&#x7279;&#x6027;&#x6765;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#x3002;</p>
<h1 id="&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;">&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;</h1>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x73A9;&#x5BB6;&#x59CB;&#x7EC8;&#x671D;&#x5411;&#x9F20;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5982;&#x4E0B;&#x8BBE;&#x7F6E;&#xFF1A;</p>
<p><img src="evnet/94f4a1ab.png" alt=""></p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6E38;&#x620F;&#x7684;&#x6BCF;&#x4E00;&#x5E27;&#x753B;&#x9762;&#x90FD;&#x662F;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x7684;&#x753B;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x73A9;&#x5BB6;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x671D;&#x5411;&#x9F20;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x90A3;&#x4E48;&#x6E38;&#x620F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x73A9;&#x5BB6;&#x59CB;&#x7EC8;&#x671D;&#x5411;&#x9F20;&#x6807;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5236;&#x4F5C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x5427;&#x3002;&#x53CC;&#x51FB;&#x4E8B;&#x4EF6;&#x8868;&#x5355;&#x4E2D;&#x7684;&#x7A7A;&#x767D;&#x533A;&#x57DF;&#xFF0C;&#x4F1A;&#x5F39;&#x51FA;&#x6DFB;&#x52A0;&#x6761;&#x4EF6;(condition)&#x7684;&#x5BF9;&#x8BDD;&#x6846;:</p>
<p><img src="evnet/7d07579f.png" alt=""></p>
<p>&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x5141;&#x8BB8;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6761;&#x4EF6;&#x548C;&#x52A8;&#x4F5C;&#xFF0C;&#x6761;&#x4EF6;&#x548C;&#x52A8;&#x4F5C;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x8FD0;&#x884C;&#x8868;&#x73B0;&#x3002;</p>
<p><code>System</code>&#x662F;Construct&#x7684;&#x5185;&#x7F6E;&#x7279;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53CC;&#x51FB;<code>System</code>&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x5BF9;&#x8BDD;&#x6846;&#x4F1A;&#x5217;&#x51FA;&#x6765;&#x6240;&#x6709;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</p>
<p><img src="evnet/a3efee32.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53CC;&#x51FB;<code>Every tick</code>&#x6761;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x4F1A;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x4E8B;&#x4EF6;&#x7684;&#x521B;&#x5EFA;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#xFF0C;&#x8BA9;&#x73A9;&#x5BB6;&#x770B;&#x7740;&#x9F20;&#x6807;&#x3002;&#x5355;&#x51FB;&#x4E8B;&#x4EF6;&#x53F3;&#x4FA7;&#x7684;<code>Add action</code>&#x94FE;&#x63A5;
<img src="evnet/4c3afc39.png" alt="">
&#x4F1A;&#x6253;&#x5F00;&#x5982;&#x4E0B;&#x5BF9;&#x8BDD;&#x6846;</p>
<p><img src="evnet/ffb02518.png" alt=""></p>
<p>&#x548C;&#x6DFB;&#x52A0;&#x4E8B;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x7684;&#x6E38;&#x620F;&#x73A9;&#x5BB6;&#x5BF9;&#x8C61;&#xFF0C;&#x53CC;&#x51FB;&#x540E;&#x4F1A;&#x5F39;&#x51FA;&#x6DFB;&#x52A0;&#x884C;&#x4E3A;&#x5BF9;&#x8BDD;&#x6846;&#xFF1A;
<img src="evnet/2b5ac478.png" alt=""></p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;<code>8 Direction</code>&#x4E5F;&#x6709;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x5148;&#x4E0D;&#x5173;&#x5FC3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9009;&#x62E9;<code>set angle toward position</code>(&#x8BBE;&#x7F6E;&#x671D;&#x5411;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x7684;&#x89D2;&#x5EA6;)&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4F7F;&#x7528;<code>set angle</code>(&#x8BBE;&#x7F6E;&#x73A9;&#x5BB6;&#x7684;&#x671D;&#x5411;&#x89D2;&#x5EA6;&#x503C;)&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x6EE1;&#x8DB3;&#x4E0D;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x3002;
&#x800C;<code>set angle toward position</code>&#x4F1A;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x73A9;&#x5BB6;&#x4F4D;&#x7F6E;&#x548C;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x7684;&#x89D2;&#x5EA6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x9009;&#x62E9;&#x5982;&#x56FE;&#x6240;&#x793A;&#x7684;&#x9009;&#x9879;&#xFF1A;
<img src="evnet/15ea3a09.png" alt=""></p>
<p>&#x53CC;&#x51FB;&#x540E;&#x4F1A;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x586B;&#x5199;&#x5750;&#x6807;&#xFF0C;X&#x3001;Y&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x8BE5;&#x52A8;&#x4F5C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6761;&#x4EF6;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x6709;&#x53C2;&#x6570;&#x7684;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;<code>every tick</code>&#x6761;&#x4EF6;&#x662F;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x8BBE;&#x7F6E;&#x8BBE;&#x7F6E;&#x89D2;&#x5EA6;&#x671D;&#x5411;&#x9F20;&#x6807;&#xFF0C;&#x800C;&#x9F20;&#x6807;&#x5BF9;&#x8C61;<code>Mouse Object</code>&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;:
<img src="evnet/a94e6de2.png" alt="">
&#x8F93;&#x5165;&#x7684;<code>Mouse.x</code>&#x548C;<code>Mouse.y</code>&#x88AB;&#x79F0;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x8F93;&#x5165;<code>Mouse.x+100</code>&#x6216;&#x8005;<code>sin(Mouse.x)</code>&#x7684;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x6765;&#x53C2;&#x4E0E;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x8868;&#x8FBE;&#x5F0F;&#x4F7F;&#x5F97;Construct&#x5341;&#x5206;&#x7075;&#x6D3B;&#x5F3A;&#x5927;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x5982;&#x679C;&#x51FA;&#x73B0;<code>Mouse is not an object name</code>&#xFF0C;&#x8BF7;&#x786E;&#x8BA4;&#x4F60;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x4E86;<code>Mouse Object</code>
<img src="evnet/83253e12.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7591;&#x60D1;&#xFF0C;&#x96BE;&#x9053;&#x6211;&#x8981;&#x8BB0;&#x4F4F;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x8868;&#x8FBE;&#x5F0F;&#x4E48;&#xFF1F;</p>
<p>&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#xFF0C;Construct&#x5728;&#x4F60;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x7ED9;&#x51FA;&#x63D0;&#x793A;&#x53EF;&#x7528;&#x7684;&#x8F93;&#x5165;&#x5217;&#x8868;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x5BF9;&#x8C61;&#x90FD;&#x62E5;&#x6709;&#x4EC0;&#x4E48;&#x5C5E;&#x6027;&#x53EF;&#x4F9B;&#x4F7F;&#x7528;&#x3002;</p>
<p><img src="evnet/42e3111c.png" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x6709;&#x54EA;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;<code>Find  Expressions</code>&#x67E5;&#x770B;&#x6240;&#x6709;&#x7684;&#x53EF;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x5217;&#x8868;&#xFF0C;&#x76F4;&#x63A5;&#x53CC;&#x51FB;&#x67D0;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x63D2;&#x5165;&#x3002;</p>
<p><img src="evnet/93aea9aa.png" alt=""></p>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x5982;&#x56FE;&#x6240;&#x793A;:
<img src="evnet/94f4a1ab.png" alt=""></p>
<p>&#x8FD0;&#x884C;&#x6E38;&#x620F;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x73A9;&#x5BB6;&#x4F1A;&#x4F7F;&#x7528;&#x9762;&#x5BF9;&#x9F20;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x606D;&#x559C;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x903B;&#x8F91;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="behaviors.html" class="navigation navigation-prev " aria-label="Previous page: 添加行为">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="logic.html" class="navigation navigation-next " aria-label="Next page: 添加游戏逻辑">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"添加事件","level":"1.2.4","depth":2,"next":{"title":"添加游戏逻辑","level":"1.2.5","depth":2,"path":"doc/beginner/logic.md","ref":"doc/beginner/logic.md","articles":[]},"previous":{"title":"添加行为","level":"1.2.3","depth":2,"path":"doc/beginner/behaviors.md","ref":"doc/beginner/behaviors.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","github-issue-feedback","search-title","anchorjs","splitter","expandable-chapters-small","github"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github-issue-feedback":{"repo":"tidys/construct3-doc-zh","branch":"master"},"github":{"url":"https://github.com/tidys/construct3-doc-zh"},"splitter":{},"search":{"maxIndexSize":1000000000},"lunr":{"maxIndexSize":1000000000},"fontsettings":{"theme":"white","family":"sans","size":2},"search-title":{},"highlight":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","author":"xu_yanfeng","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"Construct3中文翻译文档","language":"zh-hans","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null}},"gitbook":"*","description":"Construct3中文翻译文档","extension":null},"file":{"path":"doc/beginner/event.md","mtime":"2020-05-10T11:05:26.942Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-05-10T11:06:27.208Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-github-issue-feedback/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-title/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-title/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-anchorjs/anchor.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

