
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>添加行为 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="event.html" />
    
    
    <link rel="prev" href="object.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="beginner-guide.html">
            
                <a href="beginner-guide.html">
            
                    
                    初学者教程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="object.html">
            
                <a href="object.html">
            
                    
                    添加对象
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="behaviors.html">
            
                <a href="behaviors.html">
            
                    
                    添加行为
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="event.html">
            
                <a href="event.html">
            
                    
                    添加事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="logic.html">
            
                <a href="logic.html">
            
                    
                    添加游戏逻辑
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    使用变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="keeping-score.html">
            
                <a href="keeping-score.html">
            
                    
                    记分
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="display-score.html">
            
                <a href="display-score.html">
            
                    
                    显示分数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="finish.html">
            
                <a href="finish.html">
            
                    
                    完成
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >添加行为</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6DFB;&#x52A0;behaviors&#x884C;&#x4E3A;">&#x6DFB;&#x52A0;<code>behaviors</code>(&#x884C;&#x4E3A;)</h1>
<p><code>behaviors</code>(&#x884C;&#x4E3A;)&#x53EF;&#x4EE5;&#x4F7F;&#x5BF9;&#x8C61;&#x5FEB;&#x901F;&#x62E5;&#x6709;&#x67D0;&#x79CD;&#x884C;&#x4E3A;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;<code>Platform</code>(&#x5E73;&#x53F0;)&#x884C;&#x4E3A;&#xFF0C;&#x63A5;&#x7740;&#x7ED9;&#x5730;&#x677F;&#x6DFB;&#x52A0;<code>Solid</code>(&#x56FA;&#x4F53;)&#x884C;&#x4E3A;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x50CF;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x8DF3;&#x8DC3;&#x6E38;&#x620F;&#x4E00;&#x6837;&#x8DF3;&#x6765;&#x8DF3;&#x53BB;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;<code>event</code>(&#x4E8B;&#x4EF6;)&#x4E2D;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x884C;&#x4E3A;&#x66F4;&#x5FEB;&#x901F;&#x7B80;&#x5355;&#xFF01;</p>
<p>&#x5728;Construct3&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x884C;&#x4E3A;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x5728;&#x672C;&#x6559;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x90E8;&#x5206;&#x884C;&#x4E3A;&#xFF1A;</p>
<ul>
<li><code>8 Direction</code>:&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x5411;&#x6309;&#x952E;&#x6765;&#x81EA;&#x7531;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#x6E38;&#x620F;&#x4E2D;&#x4F7F;&#x7528;&#x65B9;&#x5411;&#x952E;&#x63A7;&#x5236;&#x73A9;&#x5BB6;&#x7684;&#x79FB;&#x52A8;&#x3002;</li>
<li><code>Bullet</code>: &#x7269;&#x4F53;&#x4F1A;&#x50CF;&#x73A9;&#x5BB6;&#x5C04;&#x51FB;&#x7684;&#x5B50;&#x5F39;&#x90A3;&#x6837;&#xFF0C;&#x6CBF;&#x7740;&#x5F53;&#x524D;&#x65B9;&#x5411;&#x4E00;&#x76F4;&#x524D;&#x8FDB;&#x79FB;&#x52A8;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x79FB;&#x52A8;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x602A;&#x7269;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x8FD0;&#x52A8;&#x7684;&#x3002;</li>
<li><code>Scroll To</code>: &#x5C4F;&#x5E55;&#x4F1A;&#x59CB;&#x7EC8;&#x8DDF;&#x968F;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BA9;&#x73A9;&#x5BB6;&#x59CB;&#x7EC8;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x7684;&#x4E2D;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x5C31;&#x518D;&#x5408;&#x9002;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;</li>
<li><code>Bound To Layout</code>: &#x8BE5;&#x884C;&#x4E3A;&#x5C06;&#x963B;&#x6B62;&#x5BF9;&#x8C61;&#x79BB;&#x5F00;&#x6307;&#x5B9A;&#x7684;&#x5E03;&#x5C40;&#x533A;&#x57DF;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x76D2;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x73A9;&#x5BB6;&#x4EC5;&#x9650;&#x5728;&#x76D2;&#x5B50;&#x7684;&#x533A;&#x57DF;&#x79FB;&#x52A8;&#x3002;</li>
<li><code>Destroy Outside Layout</code>&#xFF1A; &#x5F53;&#x7269;&#x4F53;&#x79BB;&#x5F00;&#x5E03;&#x5C40;&#x533A;&#x57DF;&#x65F6;&#x9500;&#x6BC1;&#x5B83;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5B50;&#x5F39;&#x79BB;&#x5F00;&#x6307;&#x5B9A;&#x7684;&#x533A;&#x57DF;&#x540E;&#x6467;&#x6BC1;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4ED6;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x5F39;&#x5C06;&#x98DE;&#x51FA;&#x5C4F;&#x5E55;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x4F1A;&#x9500;&#x6BC1;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x6C38;&#x8FDC;&#x7684;&#x5360;&#x7528;&#x90E8;&#x5206;&#x5185;&#x5B58;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x5F39;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x80FD;&#x5BF9;&#x6E38;&#x620F;&#x6027;&#x80FD;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;</li>
<li><code>Fade</code>&#xFF1A;&#x4F7F;&#x7269;&#x4F53;&#x5177;&#x6709;&#x6DE1;&#x51FA;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x7206;&#x70B8;&#x540E;&#x7684;&#x6D88;&#x5931;</li>
</ul>
<p>&#x4E86;&#x89E3;&#x4E86;&#x4EE5;&#x4E0A;&#x7684;&#x884C;&#x4E3A;&#x540E;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x4ED6;&#x4EEC;&#x6DFB;&#x52A0;&#x5230;&#x9700;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#x4E0A;&#x5427;&#xFF01;</p>
<h2 id="&#x5982;&#x4F55;&#x6DFB;&#x52A0;&#x884C;&#x4E3A;">&#x5982;&#x4F55;&#x6DFB;&#x52A0;&#x884C;&#x4E3A;</h2>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7ED9;&#x73A9;&#x5BB6;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;<code>8 Direction</code>&#x884C;&#x4E3A;&#x3002;  </p>
<p>&#x70B9;&#x51FB;&#x9009;&#x4E2D;&#x73A9;&#x5BB6;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x5C5E;&#x6027;&#x680F;&#x4E2D;&#x4F1A;&#x53D1;&#x73B0;&#x6709;<code>Behaviors</code>(&#x884C;&#x4E3A;)&#x5206;&#x7C7B;&#xFF0C;&#x70B9;&#x51FB;<code>Behaviors</code>&#x94FE;&#x63A5;&#xFF0C;&#x7F16;&#x8F91;&#x5668;&#x5C06;&#x6253;&#x5F00;&#x5982;&#x56FE;&#x7684;&#x884C;&#x4E3A;&#x5BF9;&#x8BDD;&#x6846;&#x754C;&#x9762;&#xFF1A;</p>
<p><img src="behaviors/39ac9eac.png" alt=""></p>
<p>&#x70B9;&#x51FB;<code>Add new behavior</code>&#xFF0C;&#x53CC;&#x51FB;<code>8 Direction</code>&#x884C;&#x4E3A;&#x5B8C;&#x6210;&#x6DFB;&#x52A0;&#xFF1A;</p>
<p><img src="behaviors/d65f236f.png" alt=""></p>
<p>&#x518D;&#x6B21;&#x6267;&#x884C;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6B21;&#x6DFB;&#x52A0;<code>ScrollTo</code>&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x5C4F;&#x5E55;&#x59CB;&#x7EC8;&#x8DDF;&#x968F;&#x73A9;&#x5BB6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6DFB;&#x52A0;<code>BoundToLayout</code>&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x73A9;&#x5BB6;&#x7684;&#x6D3B;&#x52A8;&#x8303;&#x56F4;&#x4EC5;&#x9650;&#x6307;&#x5B9A;&#x7684;&#x533A;&#x57DF;&#x3002;&#x6700;&#x7EC8;&#x4F60;&#x7684;&#x884C;&#x4E3A;&#x5BF9;&#x8BDD;&#x6846;&#x5E94;&#x8BE5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="behaviors/afda420e.png" alt=""></p>
<p>&#x5173;&#x95ED;&#x884C;&#x4E3A;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x7740;&#x6309;<code>Preview</code>&#x6765;&#x9884;&#x89C8;&#x4E0B;&#x6E38;&#x620F;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x5411;&#x952E;&#x6765;&#x79FB;&#x52A8;&#x73A9;&#x5BB6;&#xFF0C;&#x5E76;&#x4E14;&#x5C4F;&#x5E55;&#x4F1A;&#x8DDF;&#x968F;&#x73A9;&#x5BB6;&#x7684;&#x79FB;&#x52A8;&#x3002;&#x5E76;&#x4E14;&#x56E0;&#x4E3A;<code>BoundToLayout</code>&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x73A9;&#x5BB6;&#x4E0D;&#x80FD;&#x79FB;&#x52A8;&#x5230;&#x5E03;&#x5C40;&#x5916;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x4FBF;&#x4E4B;&#x5904;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x5FEB;&#x901F;&#x6DFB;&#x52A0;&#x76F8;&#x540C;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x540E;&#x7EED;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x7CFB;&#x7EDF;&#x6765;&#x6DFB;&#x52A0;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<h1 id="&#x6DFB;&#x52A0;&#x5176;&#x4ED6;&#x884C;&#x4E3A;">&#x6DFB;&#x52A0;&#x5176;&#x4ED6;&#x884C;&#x4E3A;</h1>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x60F3;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x884C;&#x4E3A;&#xFF1A;&#x9009;&#x4E2D;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x884C;&#x4E3A;&#x94FE;&#x63A5;&#xFF0C;&#x6253;&#x5F00;&#x884C;&#x4E3A;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x5E76;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x884C;&#x4E3A;&#x3002;
&#x8BA9;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x7684;&#x884C;&#x4E3A;&#x5427;&#xFF1A;</p>
<ol>
<li><p>&#x4E3A;&#x5B50;&#x5F39;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;<code>Bullet</code>&#x548C;<code>Destroy Outside Layout</code>&#x884C;&#x4E3A;&#xFF0C;</p>
</li>
<li><p>&#x4E3A;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;<code>Bullet</code>&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x620F;&#x4E2D;&#x602A;&#x7269;&#x662F;&#x6162;&#x6162;&#x79FB;&#x52A8;&#x524D;&#x8FDB;&#x7684;&#x3002;</p>
</li>
<li><p>&#x4E3A;&#x7206;&#x70B8;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;<code>Fade</code>&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x7206;&#x70B8;&#x5728;&#x51FA;&#x73B0;&#x540E;&#x6094;&#x6162;&#x6162;&#x6D88;&#x5931;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<code>Fade</code>&#x884C;&#x4E3A;&#x4F1A;&#x5728;&#x884C;&#x4E3A;&#x7ED3;&#x675F;&#x540E;&#x81EA;&#x52A8;&#x9500;&#x6BC1;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x8282;&#x7701;&#x6E38;&#x620F;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x4FDD;&#x8BC1;&#x6E38;&#x620F;&#x7684;&#x6D41;&#x7545;&#x6027;&#x3002;</p>
</li>
</ol>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD0;&#x884C;&#x6E38;&#x620F;&#x540E;&#x4F1A;&#x53D1;&#x73B0;&#x5B50;&#x5F39;&#x548C;&#x602A;&#x7269;&#x7684;&#x79FB;&#x52A8;&#x901F;&#x5EA6;&#x4E00;&#x6837;&#x5FEB;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8C03;&#x6162;&#x4E00;&#x70B9;&#x602A;&#x7269;&#x7684;&#x79FB;&#x52A8;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x5C5E;&#x6027;&#x680F;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x4E86;<code>Bullet Movement</code>&#x884C;&#x4E3A;&#xFF0C;&#x91CC;&#x9762;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5C5E;&#x6027;&#xFF1A;
<img src="behaviors/96da4869.png" alt=""></p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x884C;&#x4E3A;&#x7684;&#x5177;&#x4F53;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;<code>Speed</code>(&#x901F;&#x5EA6;)&#x4ECE;400&#x8C03;&#x6574;&#x4E3A;80&#xFF08;&#x4EE5;&#x6BCF;&#x79D2;&#x79FB;&#x52A8;&#x7684;&#x50CF;&#x7D20;&#x4E3A;&#x5355;&#x4F4D;&#xFF09;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x6539;&#x53D8;&#x5B50;&#x5F39;&#x7684;&#x901F;&#x5EA6;&#x4E3A;600&#xFF0C;&#x7206;&#x70B8;&#x5BF9;&#x8C61;&#x7684;<code>Fade out time</code>&#xFF08;&#x6DE1;&#x51FA;&#x65F6;&#x95F4;&#xFF09;&#x4E3A;0.5s</p>
<h1 id="&#x751F;&#x6210;&#x66F4;&#x591A;&#x7684;&#x602A;&#x7269;">&#x751F;&#x6210;&#x66F4;&#x591A;&#x7684;&#x602A;&#x7269;</h1>
<p>&#x6309;&#x4F4F;&#x952E;&#x76D8;&#x7684;<code>Control</code>&#x952E;&#xFF0C;&#x5355;&#x51FB;&#x5E76;&#x62D6;&#x52A8;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x65F6;&#x5C06;&#x4F1A;&#x590D;&#x5236;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>Control</code>+&#x9F20;&#x6807;&#x62D6;&#x52A8;&#xFF0C;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x65B0;&#x7684;&#x602A;&#x7269;&#x5427;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x602A;&#x7269;&#x7684;&#x4F4D;&#x7F6E;&#x5C3D;&#x91CF;&#x79BB;&#x73A9;&#x5BB6;&#x8FDC;&#x4E00;&#x70B9;&#xFF0C;&#x5426;&#x5219;&#x6E38;&#x620F;&#x53EF;&#x80FD;&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x73A9;&#x5BB6;&#x5C31;&#x4F1A;&#x9A6C;&#x4E0A;&#x6B7B;&#x4EA1;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Control</code>+&#x9F20;&#x6807;&#x6EDA;&#x8F6E;&#x6765;&#x653E;&#x5927;&#x7F29;&#x5C0F;&#x5E03;&#x5C40;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x7684;&#x8C03;&#x6574;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7684;&#x6548;&#x679C;&#x5982;&#x56FE;&#x6240;&#x793A;:</p>
<p><img src="behaviors/495d7793.png" alt=""></p>
<p>&#x5BF9;&#x8C61;&#x7684;&#x672C;&#x8D28;&#x662F;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x522B;&#x3002;&#x5728;&#x4E8B;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x5904;&#x7406;&#x7684;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x540D;&#x5B57;&#x53EB;&#x505A;<code>&#x5B50;&#x5F39;&#x548C;&#x602A;&#x7269;&#x76F8;&#x649E;</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x5B50;&#x5F39;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x548C;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x4F8B;&#x53D1;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x602A;&#x7269;&#x5BF9;&#x8C61;&#x5236;&#x9020;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x540E;&#x7EED;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x654C;&#x4EBA;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x7684;&#x654C;&#x4EBA;&#x5BF9;&#x8C61;&#x662F;&#x8FD9;&#x4E2A;&#x654C;&#x4EBA;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x6765;&#x6DFB;&#x52A0;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6E38;&#x620F;&#x903B;&#x8F91;&#xFF0C;&#x5728;&#x4E8B;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;Construct&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x89C6;&#x5316;&#x7F16;&#x7A0B;&#x65B9;&#x6848;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="object.html" class="navigation navigation-prev " aria-label="Previous page: 添加对象">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="event.html" class="navigation navigation-next " aria-label="Next page: 添加事件">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"添加行为","level":"1.4","depth":1,"next":{"title":"添加事件","level":"1.5","depth":1,"path":"doc/event.md","ref":"./doc/event.md","articles":[]},"previous":{"title":"添加对象","level":"1.3","depth":1,"path":"doc/object.md","ref":"./doc/object.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"doc/behaviors.md","mtime":"2020-05-08T16:02:26.350Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-05-08T16:03:09.119Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

